# Import Libraries

In [1]:
import numpy as np
import pandas as pd
import sqlite3

# Orders Data Extraction

In [2]:
orders = pd.read_csv("orders.csv")
orders

,ID_Order,ID_Customer,ID_Item,DateTime_CartFinalize,Amount_Gross_Order,city_name_fa,Quantity_item
0,2714054,469662,21386,2015-10-15 08:50:56.000,597982.0,محمود آباد,1.0
1,11104039,3063877,248497,2018-02-11 00:29:26.000,980000.0,خرمدره,1.0
2,4228130,3184893,50144,2016-06-14 00:30:08.000,229358.0,قرچک,1.0
3,22225624,6888562,70208,2018-09-03 14:37:19.000,16514.0,قم,1.0
4,4068771,2533490,67627,2016-05-21 11:51:02.000,133028.0,تهران,1.0
...,...,...,...,...,...,...,...
199995,12172771,4403268,445940,2018-04-03 12:07:01.000,344037.0,تهران,2.0
199996,4425393,3745774,131645,2016-07-09 19:14:09.000,600000.0,محمدیه,1.0
199997,6671889,4845514,215045,2017-03-08 23:47:06.000,450000.0,اصفهان,1.0
199998,6315995,2541418,264021,2017-02-08 14:59:39.000,193486.0,همدان,1.0
199999,7584127,1342585,89427,2017-06-17 10:08:06.000,55046.0,بندر انزلی,1.0

In [3]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200000 entries, 0 to 199999
Data columns (total 7 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   ID_Order               200000 non-null  int64
 1   ID_Customer            200000 non-null  int64
 2   ID_Item                200000 non-null  int64
 3   DateTime_CartFinalize  200000 non-null  object
 4   Amount_Gross_Order     200000 non-null  float64
 5   city_name_fa           200000 non-null  object
 6   Quantity_item          200000 non-null  float64
dtypes: float64(2), int64(3), object(2)
memory usage: 10.7+ MB

In [4]:
orders.describe()

,ID_Order,ID_Customer,ID_Item,Amount_Gross_Order,Quantity_item
count,2.000000e+05,2.000000e+05,2.000000e+05,2.000000e+05,200000.000000
mean,9.871963e+06,2.860671e+06,3.757313e+05,1.458204e+06,1.261225
std,6.404275e+06,1.921815e+06,3.948462e+05,5.450972e+06,1.801186
min,1.000411e+06,4.661320e+05,7.600000e+01,0.000000e+00,1.000000
25%,5.022253e+06,1.021053e+06,8.955725e+04,1.212730e+05,1.000000
50%,8.591270e+06,2.895180e+06,2.302210e+05,3.211010e+05,1.000000
75%,1.246037e+07,4.179218e+06,5.192668e+05,1.011032e+06,1.000000
max,2.484656e+07,7.282118e+06,2.093722e+06,1.530000e+09,500.000000

In [5]:
orders.isna().sum()

ID_Order                 0
ID_Customer              0
ID_Item                  0
DateTime_CartFinalize    0
Amount_Gross_Order       0
city_name_fa             0
Quantity_item            0
dtype: int64

## DataFrame Correction

In [6]:
# تبدیل ستون‌های مورد نیاز به نوع داده صحیح

orders['Amount_Gross_Order'] = pd.to_numeric(orders['Amount_Gross_Order'], errors='coerce').astype(np.int64)

orders['Quantity_item'] = pd.to_numeric(orders['Quantity_item'], errors='coerce').astype(np.int64)

In [7]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200000 entries, 0 to 199999
Data columns (total 7 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   ID_Order               200000 non-null  int64
 1   ID_Customer            200000 non-null  int64
 2   ID_Item                200000 non-null  int64
 3   DateTime_CartFinalize  200000 non-null  object
 4   Amount_Gross_Order     200000 non-null  int64
 5   city_name_fa           200000 non-null  object
 6   Quantity_item          200000 non-null  int64
dtypes: int64(5), object(2)
memory usage: 10.7+ MB

## Adding Total_Sales_Value

In [8]:
orders['Total_Sales_Value'] = orders['Amount_Gross_Order'] * orders['Quantity_item']
orders

,ID_Order,ID_Customer,ID_Item,DateTime_CartFinalize,Amount_Gross_Order,city_name_fa,Quantity_item,Total_Sales_Value
0,2714054,469662,21386,2015-10-15 08:50:56.000,597982,محمود آباد,1,597982
1,11104039,3063877,248497,2018-02-11 00:29:26.000,980000,خرمدره,1,980000
2,4228130,3184893,50144,2016-06-14 00:30:08.000,229358,قرچک,1,229358
3,22225624,6888562,70208,2018-09-03 14:37:19.000,16514,قم,1,16514
4,4068771,2533490,67627,2016-05-21 11:51:02.000,133028,تهران,1,133028
...,...,...,...,...,...,...,...,...
199995,12172771,4403268,445940,2018-04-03 12:07:01.000,344037,تهران,2,688074
199996,4425393,3745774,131645,2016-07-09 19:14:09.000,600000,محمدیه,1,600000
199997,6671889,4845514,215045,2017-03-08 23:47:06.000,450000,اصفهان,1,450000
199998,6315995,2541418,264021,2017-02-08 14:59:39.000,193486,همدان,1,193486
199999,7584127,1342585,89427,2017-06-17 10:08:06.000,55046,بندر انزلی,1,55046

# Five Cities with the most orders

## بدون در نظر گرفتن Amount_Gross_Order

In [9]:
# orders.columns
top_five_cities_raw = orders['city_name_fa'].value_counts().head(5)
top_five_cities_raw

city_name_fa
تهران     108306
مشهد        6024
اصفهان      5992
کرج         5934
اهواز       4313
Name: count, dtype: int64

## با در نظر گرفتن Amount_Gross_Order

In [10]:
city_sales = orders.groupby('city_name_fa')['Amount_Gross_Order'].sum().sort_values(ascending=False)

top_five_cities = city_sales.head(5)

print("--- نتایج تحلیل فروش بر اساس شهر (کل داده‌ها) ---")
top_five_cities

--- نتایج تحلیل فروش بر اساس شهر (کل داده‌ها) ---

city_name_fa
تهران     152743141946
اصفهان      9459528103
کرج         8992794977
مشهد        8714945130
شیراز       6093235024
Name: Amount_Gross_Order, dtype: int64

## کالا هایی که در این 5 شهر بیشترین فروش را داشتند.

##  استخراج داده‌های 5 شهر برتر برای تحلیل

In [11]:
top_5_city_names = top_five_cities.index.tolist()
orders_top_5 = orders[orders['city_name_fa'].isin(top_5_city_names)]
orders_top_5.value_counts()

orders_top_5.to_csv("top_five_cities_orders.csv", index=False)
orders_top_5

,ID_Order,ID_Customer,ID_Item,DateTime_CartFinalize,Amount_Gross_Order,city_name_fa,Quantity_item,Total_Sales_Value
4,4068771,2533490,67627,2016-05-21 11:51:02.000,133028,تهران,1,133028
5,11479246,2841640,312932,2018-03-01 12:07:15.000,290000,مشهد,1,290000
6,8267421,5235886,42365,2017-08-19 13:30:24.000,55046,اصفهان,1,55046
8,9916301,1145709,102588,2017-12-11 19:33:59.000,34862,تهران,1,34862
10,4605740,637880,138296,2016-08-02 10:48:18.000,469358,تهران,1,469358
...,...,...,...,...,...,...,...,...
199989,8320537,659553,192749,2017-08-24 11:38:29.000,37798,تهران,24,907152
199991,23311624,4293370,1193629,2018-10-15 18:03:08.000,370000,تهران,1,370000
199994,4228418,3720408,123312,2016-06-14 05:05:39.000,120000,تهران,1,120000
199995,12172771,4403268,445940,2018-04-03 12:07:01.000,344037,تهران,2,688074
199997,6671889,4845514,215045,2017-03-08 23:47:06.000,450000,اصفهان,1,450000

### بیشترین کالا های فروخته شده از نظر تعداد و ارزش در 5 شهر پرفروش

#### تحلیل پرفروش‌ترین 10 کالاها بر اساس تعداد (Quantity)

In [12]:
top_items_by_quantity = orders_top_5.groupby('ID_Order')['Quantity_item'].sum().sort_values(ascending=False).head(10)
top_items_by_quantity = top_items_by_quantity.astype(np.int64)

top_items_by_quantity = top_items_by_quantity.reset_index()
top_items_by_quantity

   ID_Order  Quantity_item
0  11842273            200
1   5827626            100
2   3008233            100
3   8753075             85
4   6521928             67
5   5487992             60
6   4783386             57
7  22276136             50
8   5951502             48
9   5118424             47

In [13]:
top_items_by_quantity.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   ID_Order       10 non-null     int64
 1   Quantity_item  10 non-null     int64
dtypes: int64(2)
memory usage: 292.0 bytes

#### پرفروش‌ترین 10 آیتم بر اساس ارزش (Value)

In [14]:
top_items_by_value = orders_top_5.groupby('ID_Order')['Amount_Gross_Order'].sum().sort_values(ascending=False).head(10)
top_items_by_value = top_items_by_value.astype(np.int64)

top_items_by_value = top_items_by_value.reset_index()

top_items_by_value

   ID_Order  Amount_Gross_Order
0   8556100          1530000000
1  13137692           166623853
2  23449403           158990000
3  10580826           157699000
4  12447089           136393670
5   8153606           115522936
6  21619597           113000000
7   9881373           111880000
8   6305168           110082569
9  20968962           109900000

In [15]:
top_items_by_value.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   ID_Order            10 non-null     int64
 1   Amount_Gross_Order  10 non-null     int64
dtypes: int64(2)
memory usage: 292.0 bytes

### Merge by Pandas

#### نمایش اطلاعات استخراج شده در جدول

##### برای 10 کالا با بیشترین تعداد فروش

In [16]:
results_top_quantity = pd.merge(
    top_items_by_quantity,
    orders,
    on='ID_Order',
    how='inner'
)
results_top_quantity

,ID_Order,Quantity_item_x,ID_Customer,ID_Item,DateTime_CartFinalize,Amount_Gross_Order,city_name_fa,Quantity_item_y,Total_Sales_Value
0,11842273,200,1107946,258611,2018-03-11 13:28:05.000,219266,تهران,200,43853200
1,5827626,100,3996961,18965,2016-12-21 18:39:09.000,178899,تهران,100,17889900
2,3008233,100,754054,100064,2015-12-16 14:23:51.000,883623,تهران,100,88362300
3,8753075,85,4984621,437891,2017-09-26 14:56:12.000,1,تهران,85,85
4,6521928,67,1368745,287961,2017-02-26 13:51:57.000,5000,تهران,67,335000
5,5487992,60,3973483,234612,2016-11-17 00:18:49.000,110092,اصفهان,60,6605520
6,4783386,57,1485614,54622,2016-08-20 09:18:43.000,2577981,تهران,57,146944917
7,22276136,50,689468,1152805,2018-09-05 00:14:59.000,71560,اصفهان,20,1431200
8,22276136,50,689468,1150890,2018-09-05 00:14:59.000,35780,اصفهان,30,1073400
9,5951502,48,2859180,227349,2017-01-02 11:15:54.000,50459,تهران,48,2422032
10,5118424,47,4087705,26161,2016-10-01 11:43:10.000,138440,مشهد,47,6506680

##### برای 10 کالا با بیشترین ارزش

In [17]:
results_top_value = pd.merge(
    top_items_by_value,
    orders,
    on='ID_Order',
    how='inner'
)
results_top_value

,ID_Order,Amount_Gross_Order_x,ID_Customer,ID_Item,DateTime_CartFinalize,Amount_Gross_Order_y,city_name_fa,Quantity_item,Total_Sales_Value
0,8556100,1530000000,643657,428330,2017-09-13 14:53:22.000,1530000000,تهران,1,1530000000
1,13137692,166623853,6960541,449189,2018-05-26 10:26:22.000,166623853,تهران,1,166623853
2,23449403,158990000,7131218,975414,2018-10-21 13:40:36.000,158990000,تهران,1,158990000
3,10580826,157699000,1018240,306698,2018-01-13 16:38:46.000,157699000,تهران,1,157699000
4,12447089,136393670,3415472,541305,2018-04-18 13:15:13.000,70990000,تهران,2,141980000
5,12447089,136393670,3415472,512703,2018-04-18 13:15:13.000,65403670,تهران,1,65403670
6,8153606,115522936,3512053,270385,2017-08-08 19:08:14.000,115522936,تهران,1,115522936
7,21619597,113000000,3220117,1351306,2018-08-13 19:59:46.000,113000000,تهران,1,113000000
8,9881373,111880000,5841506,423587,2017-12-09 10:40:28.000,111880000,تهران,1,111880000
9,6305168,110082569,929204,271546,2017-02-07 15:24:16.000,110082569,اصفهان,1,110082569
10,20968962,109900000,2967138,1191474,2018-07-22 15:54:40.000,109900000,تهران,1,109900000

##### کلیه محصولات فروخته شده در این 5 شهر (Sort By : Total_Sales_Value = ًQuantity * Gross_amount)

In [18]:
final_result = pd.merge(
    orders_top_5,
    orders,
    on='ID_Order',
    how='inner'
)
final_result.sort_values(by="Total_Sales_Value_y", ascending=False, inplace=True)
final_result.columns

Index(['ID_Order', 'ID_Customer_x', 'ID_Item_x', 'DateTime_CartFinalize_x',
       'Amount_Gross_Order_x', 'city_name_fa_x', 'Quantity_item_x',
       'Total_Sales_Value_x', 'ID_Customer_y', 'ID_Item_y',
       'DateTime_CartFinalize_y', 'Amount_Gross_Order_y', 'city_name_fa_y',
       'Quantity_item_y', 'Total_Sales_Value_y'],
      dtype='object')

In [19]:
final_result = final_result.iloc[:, :8]
final_result.columns = ['id_order', 'id_customer', 'id_item', 'DateTime', 'city_name' ,'amount_gross', 'quantity', 'total_sales']
final_result.to_csv("Top_Ordered_Items_For_Top_Five_Cities.csv", index=False)
final_result

,id_order,id_customer,id_item,DateTime,city_name,amount_gross,quantity,total_sales
21450,8556100,643657,428330,2017-09-13 14:53:22.000,1530000000,تهران,1,1530000000
126493,1122141,716378,12206,2014-02-19 13:25:00.000,11882452,تهران,30,356473560
82321,9925599,5437450,303009,2017-12-11 23:22:13.000,19990826,تهران,14,279871564
68795,6616927,3656845,241665,2017-03-04 12:52:42.000,26487156,تهران,8,211897248
47973,5908757,838763,242471,2016-12-28 16:12:55.000,35796734,تهران,5,178983670
...,...,...,...,...,...,...,...,...
120341,5220510,2904581,208936,2016-10-16 15:23:23.000,1,تهران,1,1
120326,5179037,1231077,208932,2016-10-09 16:40:44.000,1,تهران,1,1
39054,5500404,3739956,208932,2016-11-18 21:04:40.000,1,تهران,1,1
100445,3482361,3569947,51778,2016-02-22 18:21:47.000,0,تهران,2,0
83860,3931167,3635876,23108,2016-05-01 11:58:30.000,0,تهران,1,0

In [20]:
df = pd.read_csv("Top_Ordered_Items_For_Top_Five_Cities.csv")

#  جابجایی نام ستون شهر و قیمت

df.columns = [['id_order', 'id_customer', 'id_item', 'DateTime','amount_gross', 'city_name', 'quantity', 'total_sales']]
df

,id_order,id_customer,id_item,DateTime,amount_gross,city_name,quantity,total_sales
0,8556100,643657,428330,2017-09-13 14:53:22.000,1530000000,تهران,1,1530000000
1,1122141,716378,12206,2014-02-19 13:25:00.000,11882452,تهران,30,356473560
2,9925599,5437450,303009,2017-12-11 23:22:13.000,19990826,تهران,14,279871564
3,6616927,3656845,241665,2017-03-04 12:52:42.000,26487156,تهران,8,211897248
4,5908757,838763,242471,2016-12-28 16:12:55.000,35796734,تهران,5,178983670
...,...,...,...,...,...,...,...,...
133378,5220510,2904581,208936,2016-10-16 15:23:23.000,1,تهران,1,1
133379,5179037,1231077,208932,2016-10-09 16:40:44.000,1,تهران,1,1
133380,5500404,3739956,208932,2016-11-18 21:04:40.000,1,تهران,1,1
133381,3482361,3569947,51778,2016-02-22 18:21:47.000,0,تهران,2,0
133382,3931167,3635876,23108,2016-05-01 11:58:30.000,0,تهران,1,0

##### Sorting based on City_name

In [21]:
if isinstance(df.columns, pd.MultiIndex):
    df.columns = df.columns.get_level_values(0)
df_sorted = df.sort_values(by='city_name', ascending=True)
df_sorted

,id_order,id_customer,id_item,DateTime,amount_gross,city_name,quantity,total_sales
33748,11028673,6299787,512070,2018-02-06 19:56:07.000,1067431,اصفهان,1,1067431
9260,12326853,6951667,502065,2018-04-10 21:09:12.000,4302752,اصفهان,1,4302752
73176,9617278,681313,98356,2017-11-24 12:55:12.000,288991,اصفهان,1,288991
105229,12959065,3209537,673489,2018-05-15 22:37:05.000,75000,اصفهان,1,75000
55897,22869034,577999,1520812,2018-09-27 07:43:32.000,490000,اصفهان,1,490000
...,...,...,...,...,...,...,...,...
72876,24029485,2706119,1441996,2018-11-13 16:37:36.000,290000,کرج,1,290000
121811,8676967,5575368,414279,2017-09-20 23:11:33.000,55000,کرج,1,55000
100694,5532854,3933469,181874,2016-11-22 17:09:07.000,133028,کرج,1,133028
10805,1261520,998391,6430,2014-06-11 09:28:49.000,3690000,کرج,1,3690000
11582,2615020,510821,37218,2015-09-24 13:13:28.000,3471193,کرج,1,3471193

##### 10 کالا که بیشترین تعداد از آنها در هر شهر فروخته شده است.

In [22]:
df_final_sorted = df_sorted.sort_values(by=['city_name', 'quantity'], ascending=[True, False])
top_5_items_by_quantity = df_final_sorted.groupby('city_name').head(10)
top_5_items_by_quantity

,id_order,id_customer,id_item,DateTime,amount_gross,city_name,quantity,total_sales
5965,5487992,3973483,234612,2016-11-17 00:18:49.000,110092,اصفهان,60,6605520
26987,22276136,689468,1150890,2018-09-05 00:14:59.000,35780,اصفهان,30,1073400
39886,21512689,1020228,885769,2018-08-09 18:38:51.000,28440,اصفهان,30,853200
113444,11558455,6667811,401028,2018-03-03 23:35:28.000,2772,اصفهان,30,83160
33645,22276136,689468,1150890,2018-09-05 00:14:59.000,35780,اصفهان,30,1073400
10349,6086986,812472,263480,2017-01-16 22:02:05.000,154220,اصفهان,25,3855500
19528,7436836,2994061,312894,2017-05-30 14:58:23.000,84289,اصفهان,24,2022936
10507,5287193,676245,223692,2016-10-24 11:50:45.000,165458,اصفهان,23,3805534
89521,5005574,3158220,91400,2016-09-18 17:35:01.000,9174,اصفهان,20,183480
26988,22276136,689468,1152805,2018-09-05 00:14:59.000,71560,اصفهان,20,1431200
232,11842273,1107946,258611,2018-03-11 13:28:05.000,219266,تهران,200,43853200
1810,5827626,3996961,18965,2016-12-21 18:39:09.000,178899,تهران,100,17889900
42,3008233,754054,100064,2015-12-16 14:23:51.000,883623,تهران,100,88362300
133182,8753075,4984621,437891,2017-09-26 14:56:12.000,1,تهران,85,85
67944,6521928,1368745,287961,2017-02-26 13:51:57.000,5000,تهران,67,335000
9,4783386,1485614,54622,2016-08-20 09:18:43.000,2577981,تهران,57,146944917
16751,5951502,2859180,227349,2017-01-02 11:15:54.000,50459,تهران,48,2422032
30498,3005670,1460353,99005,2015-12-16 14:56:14.000,28761,تهران,43,1236723
7304,6577394,703491,254157,2017-03-02 23:36:43.000,135954,تهران,40,5438160
4039,4731592,2487055,157139,2016-08-17 00:57:33.000,241825,تهران,40,9673000
1344,12568546,4140426,133042,2018-04-24 16:52:58.000,724771,شیراز,30,21743130
18411,6568453,487410,254159,2017-03-02 02:54:47.000,135954,شیراز,16,2175264
41314,21423920,1316901,96545,2018-08-06 11:53:06.000,81651,شیراز,10,816510
12210,7821714,4787876,369749,2017-07-11 23:04:27.000,329679,شیراز,10,3296790
34429,4658036,606838,104366,2016-08-08 17:58:31.000,103807,شیراز,10,1038070
19482,9564859,638345,495497,2017-11-22 11:31:01.000,202991,شیراز,10,2029910
5962,8031121,4031748,191188,2017-07-29 00:58:32.000,661376,شیراز,10,6613760
18190,13494671,3269062,824759,2018-06-14 18:24:03.000,220000,شیراز,10,2200000
1504,5817240,2749541,240111,2016-12-20 21:49:29.000,2038532,شیراز,10,20385320
8092,12617482,5834556,585358,2018-04-27 20:07:06.000,490000,شیراز,10,4900000
6074,5118424,4087705,26161,2016-10-01 11:43:10.000,138440,مشهد,47,6506680
34334,11978790,957912,511503,2018-03-19 17:28:50.000,34862,مشهد,30,1045860
31921,22512524,2464787,125017,2018-09-13 09:51:25.000,38532,مشهد,30,1155960
38866,8558555,3977871,70154,2017-09-12 20:56:14.000,29595,مشهد,30,887850
47592,4937866,2807873,190913,2016-09-10 13:28:47.000,25000,مشهد,26,650000
7565,6735340,1024772,12532,2017-03-13 03:12:12.000,238532,مشهد,22,5247704
33552,12864831,7068512,273877,2018-05-10 22:34:20.000,54128,مشهد,20,1082560
38315,2790585,3004807,51778,2015-10-29 15:19:52.000,45000,مشهد,20,900000
52251,2918716,2842056,96536,2015-11-27 12:34:24.000,27522,مشهد,20,550440
28931,5917870,1164927,243334,2016-12-29 16:39:47.000,65954,مشهد,20,1319080
94189,8647677,754992,195857,2017-09-19 16:10:09.000,5321,کرج,30,159630
5353,6610926,721542,227359,2017-03-05 01:12:15.000,245220,کرج,30,7356600
11196,21052500,1047014,1019044,2018-07-24 22:36:40.000,119266,کرج,30,3577980
11100,6949020,774170,132860,2017-04-07 19:25:35.000,144220,کرج,25,3605500
7514,1629714,1343605,39876,2015-01-04 10:42:54.000,240000,کرج,22,5280000
388,9216171,2850052,36989,2017-10-28 12:02:57.000,1834862,کرج,20,36697240
25975,4360838,616484,181423,2016-07-02 10:25:08.000,124633,کرج,12,1495596
13984,4729151,2965063,155302,2016-08-16 19:10:51.000,240091,کرج,12,2881092
22669,6552310,3429981,254339,2017-02-28 15:17:30.000,145954,کرج,12,1751448
8357,10949838,6336680,230209,2018-02-02 20:30:09.000,394495,کرج,12,4733940

### Merge by SQL Query

#### Connect to DataBase

#### Orders to DataBase

In [23]:
db_file = 'top_orders.db'
table_name = 'orders_table'
print(f"Primary DataFrame :\n{orders}\n")

try:

    conn = sqlite3.connect(db_file)
    orders.to_sql(table_name, conn, if_exists='replace', index=False)

    df_from_sql = pd.read_sql_query(f"SELECT * FROM {table_name}", conn)

except Exception as e:
    print(f"Connection Error: {e}")
finally:
    if 'conn' in locals() and conn:
        conn.close()
        print("\nConnection Closed Successfully.")

Primary DataFrame :
        ID_Order  ID_Customer  ID_Item    DateTime_CartFinalize  \
0        2714054       469662    21386  2015-10-15 08:50:56.000
1       11104039      3063877   248497  2018-02-11 00:29:26.000
2        4228130      3184893    50144  2016-06-14 00:30:08.000
3       22225624      6888562    70208  2018-09-03 14:37:19.000
4        4068771      2533490    67627  2016-05-21 11:51:02.000
...          ...          ...      ...                      ...
199995  12172771      4403268   445940  2018-04-03 12:07:01.000
199996   4425393      3745774   131645  2016-07-09 19:14:09.000
199997   6671889      4845514   215045  2017-03-08 23:47:06.000
199998   6315995      2541418   264021  2017-02-08 14:59:39.000
199999   7584127      1342585    89427  2017-06-17 10:08:06.000

        Amount_Gross_Order city_name_fa  Quantity_item  Total_Sales_Value
0                   597982   محمود آباد              1             597982
1                   980000       خرمدره              1             980000
2                   229358         قرچک              1             229358
3                    16514           قم              1              16514
4                   133028        تهران              1             133028
...                    ...          ...            ...                ...
199995              344037        تهران              2             688074
199996              600000       محمدیه              1             600000
199997              450000       اصفهان              1             450000
199998              193486        همدان              1             193486
199999               55046   بندر انزلی              1              55046

[200000 rows x 8 columns]


Connection Closed Successfully.

#### top_items_by_quantity to DataBase

In [24]:
db_file = 'top_orders.db'
table_name = 'top_items_by_quantity_table'
print(f"top_items_by_quantity_table :\n{top_items_by_quantity}\n")

try:
    conn = sqlite3.connect(db_file)
    top_items_by_quantity.to_sql(table_name, conn, if_exists='replace', index=False)

    df_from_sql = pd.read_sql_query(f"SELECT * FROM {table_name}", conn)

except Exception as e:
    print(f"Conn Error: {e}")
finally:
    if 'conn' in locals() and conn:
        conn.close()
        print("\nConnection Closed Successfully.")

top_items_by_quantity_table :
   ID_Order  Quantity_item
0  11842273            200
1   5827626            100
2   3008233            100
3   8753075             85
4   6521928             67
5   5487992             60
6   4783386             57
7  22276136             50
8   5951502             48
9   5118424             47


Connection Closed Successfully.

#### top_items_by_value to DataBase

In [25]:
db_file = 'top_orders.db'
table_name = 'top_items_by_value_table'
print(f"top_items_by_value_table :\n{top_items_by_value}\n")

try:
    conn = sqlite3.connect(db_file)

    top_items_by_value.to_sql(table_name, conn, if_exists='replace', index=False)

    df_from_sql = pd.read_sql_query(f"SELECT * FROM {table_name}", conn)

except Exception as e:
    print(f"Conn Error: {e}")
finally:
    if 'conn' in locals() and conn:
        conn.close()
        print("\nConnection Closed Successfully.")

top_items_by_value_table :
   ID_Order  Amount_Gross_Order
0   8556100          1530000000
1  13137692           166623853
2  23449403           158990000
3  10580826           157699000
4  12447089           136393670
5   8153606           115522936
6  21619597           113000000
7   9881373           111880000
8   6305168           110082569
9  20968962           109900000


Connection Closed Successfully.

#### Merge by (SQLite)

In [26]:
try:
    conn = sqlite3.connect('top_orders.db')
    cursor = conn.cursor()

    cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
    tables = cursor.fetchall()
    print("--- Available Tables ---")
    for table in tables:
        print(table[0])

        # Get field_names for each table
        print(f"--- Schema for {table[0]} ---")
        cursor.execute(f"PRAGMA table_info({table[0]});")
        schema = cursor.fetchall()
        for col in schema:
            print(f"Column: {col[1]}")
        print("-" * 20)

    conn.close()

except Exception as e:
    print(f"An error occurred: {e}")

--- Available Tables ---
orders_table
--- Schema for orders_table ---
Column: ID_Order
Column: ID_Customer
Column: ID_Item
Column: DateTime_CartFinalize
Column: Amount_Gross_Order
Column: city_name_fa
Column: Quantity_item
Column: Total_Sales_Value
--------------------
top_items_by_quantity_table
--- Schema for top_items_by_quantity_table ---
Column: ID_Order
Column: Quantity_item
--------------------
top_items_by_value_table
--- Schema for top_items_by_value_table ---
Column: ID_Order
Column: Amount_Gross_Order
--------------------

##### <li>Two DB (top_items_by_value_table & top_items_by_quantity_table are merged based on ID_Orderd )

In [27]:
conn = sqlite3.connect('top_orders.db')
cursor = conn.cursor()

sql_create_and_populate = """
CREATE TABLE final_comprehensive_report AS
SELECT
    COALESCE(Combined.ID_Order, O.ID_Order) AS ID_Order,
    COALESCE(Combined.Quantity_item, O.Quantity_item) AS Quantity_item,
    COALESCE(Combined.Amount_Gross_Order, O.Amount_Gross_Order) AS Amount_Gross_Order
FROM
    (
        SELECT
            t1.ID_Order,
            t1.Quantity_item,
            NULL AS Amount_Gross_Order
        FROM
            top_items_by_quantity_table AS t1
        LEFT JOIN
            top_items_by_value_table AS t2 ON t1.ID_Order = t2.ID_Order
        WHERE
            t2.ID_Order IS NULL

        UNION ALL


        SELECT
            t2.ID_Order,
            NULL AS Quantity_item,
            t2.Amount_Gross_Order
        FROM
            top_items_by_value_table AS t2
        LEFT JOIN
            top_items_by_quantity_table AS t1 ON t2.ID_Order = t1.ID_Order
        WHERE
            t1.ID_Order IS NULL

        UNION ALL


        SELECT
            t1.ID_Order,
            t1.Quantity_item,
            t2.Amount_Gross_Order
        FROM
            top_items_by_quantity_table AS t1
        INNER JOIN
            top_items_by_value_table AS t2 ON t1.ID_Order = t2.ID_Order
    ) AS Combined
LEFT JOIN
    orders_table AS O ON COALESCE(Combined.ID_Order, O.ID_Order) = O.ID_Order;
"""
cursor.execute(sql_create_and_populate)

conn.commit()
conn.close()

In [28]:
conn = sqlite3.connect('top_orders.db')
cursor = conn.cursor()

query = "SELECT * FROM final_comprehensive_report;"
cursor.execute(query)
rows = cursor.fetchall()
# گرفتن نام ستون‌ها برای مرجع
column_names = [description[0] for description in cursor.description]

print("fields:", column_names)
print("records:")
for row in rows[:10]:
    print(row)

conn.close()

fields: ['ID_Order', 'Quantity_item', 'Amount_Gross_Order']
records:
(11842273, 200, 219266)
(5827626, 100, 178899)
(3008233, 100, 883623)
(8753075, 85, 1)
(6521928, 67, 5000)
(5487992, 60, 110092)
(4783386, 57, 2577981)
(22276136, 50, 71560)
(22276136, 50, 35780)
(5951502, 48, 50459)

##### <li>(New Column as Total_Sales_Values from (orders_table) in DB has been added to final_comprehensive_report)

In [33]:
conn = sqlite3.connect('top_orders.db')
cursor = conn.cursor()

sql_alter = """
ALTER TABLE final_comprehensive_report
ADD COLUMN Total_Sales_Value REAL;
"""
cursor.execute(sql_alter)



sql_update = """
UPDATE final_comprehensive_report
SET Total_Sales_Value = (
    SELECT T_Orders.Total_Sales_Value
    FROM orders_table AS T_Orders
    WHERE T_Orders.ID_Order = final_comprehensive_report.ID_Order
)
WHERE EXISTS (
    SELECT 1
    FROM orders_table AS T_Orders_Check
    WHERE T_Orders_Check.ID_Order = final_comprehensive_report.ID_Order
);
"""
cursor.execute(sql_update)

conn.commit()
conn.close()

OperationalError: duplicate column name: Total_Sales_Value

In [30]:
conn = sqlite3.connect('top_orders.db')
cursor = conn.cursor()

sql_select = "SELECT * FROM final_comprehensive_report LIMIT 10;"
cursor.execute(sql_select)
results = cursor.fetchall()
column_names = [description[0] for description in cursor.description]

conn.commit()
conn.close()

print(f"ستون‌ها: {column_names}")
print("10 records from final_comprehensive_report:")
for row in results:
    print(row)

ستون‌ها: ['ID_Order', 'Quantity_item', 'Amount_Gross_Order', 'Total_Sales_Value']
10 records from final_comprehensive_report:
(11842273, 200, 219266, 43853200.0)
(5827626, 100, 178899, 17889900.0)
(3008233, 100, 883623, 88362300.0)
(8753075, 85, 1, 85.0)
(6521928, 67, 5000, 335000.0)
(5487992, 60, 110092, 6605520.0)
(4783386, 57, 2577981, 146944917.0)
(22276136, 50, 71560, 1431200.0)
(22276136, 50, 35780, 1431200.0)
(5951502, 48, 50459, 2422032.0)